import java.util.Scanner;

public class Main {
    public static void main(String[] args) {


        // Задача 1
// -----------------------------------------------------------------------------------
//        Scanner in = new Scanner(System.in);
//        System.out.println("Введите число:");
//        float input = in.nextFloat();
//
//        if (input % 2 == 0) {
//            System.out.println("Число четное.");
//        } else {
//            System.out.println("Число нечетное.");
//        }
//
//        in.close();
// -----------------------------------------------------------------------------------

        // Задача 2
// -----------------------------------------------------------------------------------
//        Scanner in = new Scanner(System.in);
//        System.out.println("Введите первое число:");
//        int input1 = in.nextInt();
//        System.out.println("Введите второе число:");
//        int input2 = in.nextInt();
//        System.out.println("Введите третье число:");
//        int input3 = in.nextInt();
//        int minNum = Math.min(input1, Math.max(input2, input3));
//
//        System.out.println("Наибольшее число: " + minNum);
// -----------------------------------------------------------------------------------

        // Задача 3
// -----------------------------------------------------------------------------------
//        for (int i = 1; i <= 10; i++)
//        {
//            System.out.println("5 * " + i +  "="  + 5 * i);
//        }
// -----------------------------------------------------------------------------------

        // Задача 4
// -----------------------------------------------------------------------------------
//                Scanner in = new Scanner(System.in);
//                System.out.println("Введите число:");
//                int input = in.nextInt();
//
//                int result = 0;
//
//                for (int i = 1; i <= input; i++) {
//                    result += i;
//                }
//
//                System.out.println(result);
//                in.close();
// -----------------------------------------------------------------------------------

        // Задача 5
// -----------------------------------------------------------------------------------
//        Scanner in = new Scanner(System.in);
//        System.out.println("Введите число:");
//        int N = in.nextInt();
//
//        if (N <= 0) {
//            System.out.println("Введите положительное целое число.");
//        } else {
//            System.out.print("Первые " + N + " чисел Фибоначчи: ");
//            int a = 0, b = 1;
//
//            for (int i = 1; i <= N; i++) {
//                System.out.print(a + " ");
//
//                int next = a + b;
//                a = b;
//                b = next;
//            }
//        }
//        in.close();
// -----------------------------------------------------------------------------------

        // Задача 6
// -----------------------------------------------------------------------------------


//        Задача 6: Проверка простого числа
//        Условие:
//        Пользователь вводит целое число. Программа должна проверить, является ли это число простым (делится только на 1 и само на себя).
//        Задача 7: Обратный порядок чисел
//        Условие:
//        Пользователь вводит целое число N. Программа должна вывести числа от N до 1 в обратном порядке.
//                Задача 8: Сумма четных чисел
//        Условие:
//        Пользователь вводит два целых числа A и B. Программа должна найти сумму всех четных чисел в диапазоне от A до B (включительно).
//                Задача 9: Реверс строки
//        Условие:
//        Пользователь вводит строку. Программа должна вывести эту строку в обратном порядке.
//        Задача 10: Количество цифр в числе
//        Условие:
//        Пользователь вводит целое число. Программа должна вывести количество цифр в этом числе.
//        Задача 11: Факториал числа
//        Условие:
//        Пользователь вводит целое число N. Программа должна вычислить факториал этого числа (N!).
//        Задача 12: Сумма цифр числа
//        Условие:
//        Пользователь вводит целое число. Программа должна найти сумму всех цифр этого числа.
//        Задача 13: Палиндром
//        Условие:
//        Пользователь вводит строку. Программа должна проверить, является ли эта строка палиндромом (читается одинаково слева направо и справа налево).
//        Задача 14: Найти максимальное число в массиве
//        Условие:
//        Пользователь вводит размер массива и элементы массива. Программа должна найти и вывести максимальное число в массиве.
//                Задача 15: Сумма всех элементов массива
//        Условие:
//        Пользователь вводит размер массива и его элементы. Программа должна вычислить и вывести сумму всех элементов массива.
//                Задача 16: Количество положительных и отрицательных чисел
//        Условие:
//        Пользователь вводит размер массива и его элементы. Программа должна подсчитать и вывести количество положительных и отрицательных чисел в массиве.
//        Задача 17: Простые числа в диапазоне
//        Условие:
//        Пользователь вводит два целых числа A и B. Программа должна вывести все простые числа в этом диапазоне (включительно).
//                Задача 18: Подсчет гласных и согласных в строке
//        Условие:
//        Пользователь вводит строку. Программа должна подсчитать и вывести количество гласных и согласных букв в этой строке.
//                Задача 19: Перестановка слов в строке
//        Условие:
//        Пользователь вводит строку, состоящую из нескольких слов. Программа должна вывести слова в обратном порядке.
//                Задача 20: Число Армстронга
//        Условие:
//        Пользователь вводит целое число. Программа должна проверить, является ли это число числом Армстронга (сумма цифр в степени, равной количеству цифр, равна самому числу).

    }
}
